INSERT INTO Destinations (dest_Name, country, Dest_type, Dest_cost) VALUES
('타이베이','대만','음식관광',2),
('시드니','호주','관광',3),
('사이판','미국','휴양',4),
('다낭','베트남','휴양',1),
('뉴욕','미국','관광',5),
('발리','인도네시아','휴양',2),
('도쿄','일본','관광',3),
('치앙마이','태국','음식관광',1),
('리스본','포르투갈','관광',3),
('오키나와','일본','휴양',3),
('인터라켄','스위스','관광',5),
('싱가포르','싱가포르','음식관광',3),
('오사카','일본','음식관광',3),
('삿포로','일본','관광',3);


INSERT INTO RecommendMonth (destID, month) VALUES
-- 타이베이 (겨울)
(1,12),(1,1),(1,2),
-- 시드니 (여름)
(2,6),(2,7),(2,8),
-- 사이판 (겨울)
(3,12),(3,1),(3,2),
-- 다낭 (겨울)
(4,12),(4,1),(4,2),
-- 뉴욕 (봄, 가을)
(5,3),(5,4),(5,5),(5,9),(5,10),(5,11),
-- 발리 (여름)
(6,6),(6,7),(6,8),
-- 도쿄 (봄, 가을)
(7,3),(7,4),(7,5),(7,9),(7,10),(7,11),
-- 치앙마이 (겨울)
(8,12),(8,1),(8,2),
-- 리스본 (여름)
(9,6),(9,7),(9,8),
-- 오키나와 (가을)
(10,9),(10,10),(10,11),
-- 인터라켄 (여름)
(11,6),(11,7),(11,8),
-- 싱가포르 (여름)
(12,6),(12,7),(12,8),
-- 오사카 (봄, 가을)
(13,3),(13,4),(13,5),(13,9),(13,10),(13,11),
-- 삿포로 (겨울)
(14,12),(14,1),(14,2);



